reports/lab3/k6-min3-c10.txt


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✗ 'p(95)<250' p(95)=252.027298


  █ TOTAL RESULTS 

    checks_total.......: 15444   250.134763/s
    checks_succeeded...: 100.00% 15444 out of 15444
    checks_failed......: 0.00%   0 out of 15444

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 5148
    predict_latency_ms.............: avg=119.389557 min=56.796857 med=94.233004 p(95)=252.027298 p(99)=383.50523 max=617.497273

    HTTP
    http_req_duration..............: avg=119.38ms   min=56.79ms   med=94.23ms   p(95)=252.02ms   p(99)=383.5ms   max=617.49ms  
      { expected_response:true }...: avg=119.38ms   min=56.79ms   med=94.23ms   p(95)=252.02ms   p(99)=383.5ms   max=617.49ms  
    http_req_failed................: 0.00%  0 out of 5148
    http_reqs......................: 5148   83.378254/s

    EXECUTION
    iteration_duration.............: avg=116.65ms   min=57.1ms    med=94.17ms   p(95)=241.31ms   p(99)=322.75ms  max=484.7ms   
    iterations.....................: 5148   83.378254/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 1.3 MB 22 kB/s
    data_sent......................: 1.2 MB 20 kB/s



time="2026-09-22T10:30:57Z" level=error msg="thresholds on metrics 'predict_latency_ms' have been crossed"