reports/lab3/k6-tuned-c1.txt


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✓ 'p(95)<250' p(95)=65.589319


  █ TOTAL RESULTS 

    checks_total.......: 3192    52.661891/s
    checks_succeeded...: 100.00% 3192 out of 3192
    checks_failed......: 0.00%   0 out of 3192

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 1064
    predict_latency_ms.............: avg=56.667597 min=47.861777 med=54.690902 p(95)=65.589319 p(99)=78.068082 max=369.779774

    HTTP
    http_req_duration..............: avg=56.66ms   min=47.86ms   med=54.69ms   p(95)=65.58ms   p(99)=78.06ms   max=369.77ms  
      { expected_response:true }...: avg=56.66ms   min=47.86ms   med=54.69ms   p(95)=65.58ms   p(99)=78.06ms   max=369.77ms  
    http_req_failed................: 0.00%  0 out of 1064
    http_reqs......................: 1064   17.553964/s

    EXECUTION
    iteration_duration.............: avg=56.41ms   min=48.08ms   med=54.91ms   p(95)=65.7ms    p(99)=77.49ms   max=218.03ms  
    iterations.....................: 1064   17.553964/s
    vus............................: 1      min=1         max=1
    vus_max........................: 1      min=1         max=1

    NETWORK
    data_received..................: 270 kB 4.5 kB/s
    data_sent......................: 247 kB 4.1 kB/s